<?php

return [

    'form2' => [

        'type' => [

            'text' => "تنها پیغام متنی قابل قبول است",
            'single_line' => "متن شما باید تک خطی باشد",

            'int' => "تنها عدد غیر اعشاری قابل قبول است",
            'number' => "تنها عدد قابل قبول است",
            'unsigned' => "تنها عدد مثبت قابل قبول است",

            'msg' => "تنها پیام قابل قبول است",
            'media' => "تنها پیام رسانه ای قابل قبول است",
            'photo' => "تنها پیام تصویری قابل قبول است",
            'msg_type' => "این نوع پیام پشتیبانی نمی شود",

            'options' => "تنها می توانید از گزینه ها استفاده کنید",
            
        ],

        'filter' => [

            'min_text' => "طول متن شما باید حداقل %min% باشد",
            'min_number' => "عدد شما باید حداقل %min% باشد",

            'max_text' => "طول متن شما باید حداکثر %max% باشد",
            'max_number' => "عدد شما باید حداکثر %max% باشد",

            'unique' => "این @{attributes.%column%}?{مقدار} قبلا وجود داشته است",
            'exists' => "این @{attributes.%column%}?{مقدار} وجود ندارد",

        ],

        'key' => [
            
            'cancel' => "لغو",

        ],

    ],

    'invalid' => [
        
        'text' => "تنها پیغام متنی قابل قبول است",
        'single_line' => "متن شما باید تک خطی باشد",

        'int' => "تنها عدد غیر اعشاری قابل قبول است",
        'number' => "تنها عدد قابل قبول است",
        'unsigned' => "تنها عدد مثبت قابل قبول است",

        'msg' => "تنها پیام قابل قبول است",
        'media' => "تنها پیام رسانه ای قابل قبول است",
        'photo' => "تنها پیام تصویری قابل قبول است",
        'msg_type' => "این نوع پیام پشتیبانی نمی شود",

        'options' => "تنها می توانید از گزینه ها استفاده کنید",
        
    ],

    'filter' => [

        'min_text' => "طول متن شما باید حداقل %min% باشد",
        'min_number' => "عدد شما باید حداقل %min% باشد",

        'max_text' => "طول متن شما باید حداکثر %max% باشد",
        'max_number' => "عدد شما باید حداکثر %max% باشد",

        'between_text' => "طول متن شما باید حداقل %min% و حداکثر %max% باشد",
        'between_number' => "عدد شما باید حداقل %min% و حداکثر %max% باشد",

        'unique' => "این @{attributes.%column%}?{مقدار} قبلا وجود داشته است",
        'exists' => "این @{attributes.%column%}?{مقدار} وجود ندارد",

    ],

    'attributes' => [

        'name' => "نام",
        'email' => "ایمیل",
        'password' => "رمز عبور",
        'phone' => "شماره",
        'id' => "آیدی",
        'user' => "کاربر",
        'role' => "نقش",
        'permission' => "دسترسی",
        'message' => "پیام",
        'photo' => "تصویر",
        'time' => "زمان",
        'date' => "تاریخ",

    ],

    'form_keys' => [

        'cancel' => "لغو",
        'skip' => "رد کردن",

    ],

    'errors' => [

        'notfound' => "یافت نشد",

    ],

];
